fe32/tutorials/rheoFoam/CrossSlot/Oldroyd-BLog/0/tau
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{

   inlet_north
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    inlet_south
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }
    walls
    {     
        type            extST;
        value           uniform (0 0 0 0 0 0);
    }  
    outlet_west
    {
         type           zeroGradient;
    }
    outlet_east
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
