fe32/tutorials/rheoFoam/CrossSlot/Oldroyd-BLog/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{
                
                type             Oldroyd-BLog;

                rho              rho [1 -3 0 0 0 0 0] 1;
                etaS             etaS [1 -1 -1 0 0 0 0] 0;
                etaP             etaP [1 -1 -1 0 0 0 0] 1;                 
                lambda           lambda [0 0 1 0 0 0 0] 0.33;  

                uTauCoupling     true;                
}

passiveScalarProperties
{
                solvePassiveScalar   on;
                D                    D [ 0 2 -1 0 0 0 0 ] 0.002; 
}

// ************************************************************************* //
